<a href="https://colab.research.google.com/github/AlineSouzaSantos/SQLcomDBeaver/blob/main/ExerciciosBancoDeDados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Carregando SQLlite para poder utilizar comandos SQL no colab
import sqlite3

In [ ]:
#Criando conexão com banco
Conexao = sqlite3.connect('Banco_Dados')

In [ ]:
#Apontar para banco
cursor = Conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto)

In [ ]:
cursor.execute('CREATE TABLE alunos (id INTEGER PRIMARY KEY,nome VARCHAR(100),idade INTEGER,curso VARCHAR(100))')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [ ]:
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('João', 20, 'Engenharia')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Maria', 22, 'Medicina')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Pedro',25, 'Ciência da Computação')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Isadora',19,'Psicologia')")
cursor.execute("INSERT INTO alunos (nome, idade, curso) VALUES ('Matheus',21,'Engenharia')")

3. Consultas Básicas:
Escreva consultas SQL para realizar as seguintes tarefas:

 a) Selecionar todos os registros da tabela "alunos".

In [ ]:
visualizar = cursor.execute('SELECT * FROM alunos')
for aluno in visualizar:
    print(aluno)

(1, 'João', 20, 'Engenharia')
(2, 'Maria', 22, 'Medicina')
(3, 'Pedro', 25, 'Ciência da Computação')
(4, 'Isadora', 19, 'Psicologia')
(5, 'Matheus', 21, 'Engenharia')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
visualizar = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for aluno in visualizar:
    print(aluno)

('Maria', 22)
('Pedro', 25)
('Matheus', 21)

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [ ]:
visualizar = cursor.execute("SELECT nome, curso FROM alunos WHERE curso = 'Engenharia' ORDER BY nome ")
for linha in visualizar:
    print(linha)

('João', 'Engenharia')
('Matheus', 'Engenharia')

d) Contar o número total de alunos na tabela

In [ ]:
visualizar = cursor.execute("SELECT COUNT(*) FROM alunos")
print("Total de alunos:", total[0])

Total de alunos: 5

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela

In [ ]:
cursor.execute("UPDATE alunos SET idade = 23 WHERE nome = 'João'")
visualizar = cursor.execute("SELECT * FROM alunos WHERE nome = 'João'")
for aluno in visualizar:
    print(aluno)

(1, 'João', 23, 'Engenharia')

b) Remova um aluno pelo seu ID.

In [ ]:
cursor.execute("DELETE FROM alunos WHERE id = 2")
visualizar = cursor.execute("SELECT * FROM alunos")
for aluno in visualizar:
    print(aluno)

(1, 'João', 23, 'Engenharia')
(3, 'Pedro', 25, 'Ciência da Computação')
(4, 'Isadora', 19, 'Psicologia')
(5, 'Matheus', 21, 'Engenharia')

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos:
id (chave primária),
nome (texto),
idade (inteiro) e
saldo (float). Insira alguns registros de clientes na tabela.

In [ ]:
cursor.execute("DROP TABLE IF EXISTS clientes")
cursor.execute("CREATE TABLE clientes (id INTEGER PRIMARY KEY, nome VARCHAR(100), idade INTEGER, saldo FLOAT)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('João', 30, 6000.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Maria', 31, 5000.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Debora', 32, 4000.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Carlos', 27, 3000.50)")
cursor.execute("INSERT INTO clientes (nome, idade, saldo) VALUES ('Claudia', 25, 2000.50)")

6. Consultas e Funções Agregadas

Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [ ]:
visualizar = cursor.execute("SELECT nome, idade FROM clientes WHERE idade>30")
for linha in visualizar:
    print(linha)

('Maria', 31)
('Debora', 32)

b) Calcule o saldo médio dos clientes

In [ ]:
visualizar = cursor.execute("SELECT AVG(saldo) FROM clientes")
for linha in visualizar:
    print(linha)

(4000.5,)

c) Encontre o cliente com o saldo máximo

In [ ]:
visualizar = cursor.execute("SELECT nome,MAX(saldo) FROM clientes")
for linha in visualizar:
    print(linha)

('João', 6000.5)

d) Conte quantos clientes têm saldo acima de 1000

In [ ]:
#Contagem de saldo para quem tem acima de mil, no caso da minha tabela, todos tem
visualizar = cursor.execute("SELECT count(saldo) FROM clientes WHERE saldo > 1000.0")
for linha in visualizar:
    print(linha)

(5,)

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [ ]:
#Aumentando o saldo do João para 10k
cursor.execute("UPDATE clientes SET saldo = 10000.0 WHERE nome = 'João'")
visualizar = cursor.execute("SELECT * FROM clientes WHERE nome = 'João'")
for linha in visualizar:
    print(linha)

(1, 'João', 30, 10000.0)

b) Remova um cliente pelo seu ID

In [ ]:
#Deletando a Maria
cursor.execute("DELETE FROM clientes WHERE id = 2")
visualizar = cursor.execute("SELECT * FROM clientes")
for linha in visualizar:
    print(linha)

(1, 'João', 30, 10000.0)
(3, 'Debora', 32, 4000.5)
(4, 'Carlos', 27, 3000.5)
(5, 'Claudia', 25, 2000.5)

8. Junção de Tabelas

Crie uma segunda tabela chamada "compras" com os campos: id(chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto(texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes".Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [ ]:
#Criando tabela compras
cursor.execute("DROP TABLE IF EXISTS compras")
cursor.execute("CREATE TABLE compras (id INTEGER PRIMARY KEY, cliente_id INTEGER, produto VARCHAR(100), valor FLOAT, FOREIGN KEY (cliente_id) REFERENCES clientes(id))")
#Inserindo compras
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (1, 'Camiseta', 29.99)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (2, 'Vestido', 39.99)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (3, 'Calça', 49.99)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (4, 'Bçusa', 59.99)")
cursor.execute("INSERT INTO compras (cliente_id, produto, valor) VALUES (5, 'Conjunto', 69.99)")

#Visualizando a tabela
visualizar = cursor.execute("SELECT * FROM compras")
for linha in visualizar:
    print(linha)

(1, 1, 'Camiseta', 29.99)
(2, 2, 'Vestido', 39.99)
(3, 3, 'Calça', 49.99)
(4, 4, 'Bçusa', 59.99)
(5, 5, 'Conjunto', 69.99)

In [ ]:
#Consulta utilizando JOIN
visualizar = cursor.execute("SELECT clientes.nome, compras.produto, compras.valor FROM clientes JOIN compras ON clientes.id = compras.cliente_id")
for linha in visualizar:
    print(linha)

('João', 'Camiseta', 29.99)
('Debora', 'Calça', 49.99)
('Carlos', 'Bçusa', 59.99)
('Claudia', 'Conjunto', 69.99)